Revit 2024 API
Face.Intersect Method (Curve)
Calculates the intersection of the specified curve with this face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public SetComparisonResult Intersect(
	Curve curve
)
Visual Basic
Public Function Intersect ( _
	curve As Curve _
) As SetComparisonResult
Visual C++
public:
SetComparisonResult Intersect(
	Curve^ curve
)
Parameters
curve
Type: Autodesk.Revit.DB.Curve
The specified curve to intersect with this face.
Return Value
SetComparisonResult.Overlap - One or more intersections were encountered.
SetComparisonResult.Subset - The curve is coincident with the surface.
SetComparisonResult.Disjoint - There is no intersection found.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  The curve is null.
Autodesk.Revit.Exceptions.InvalidOperationException |  The intersection calculation fails.
See Also
Face Class
Intersect Overload
Autodesk.Revit.DB Namespace